{
    "format": "graph-model",
    "generatedBy": "2.4.0",
    "convertedBy": "TensorFlow.js Converter v3.3.0",
    "signature": {
        "inputs": {
            "dense_128_tanh_1_input:0": {
                "name": "dense_128_tanh_1_input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "864"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "Identity:0": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "25"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "864"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "25"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "25"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "dense_128_tanh_1_input",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "864"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "dense_128_tanh_1_input",
                    "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/Tanh",
                "op": "Tanh",
                "input": [
                    "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/BiasAdd"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/Tanh",
                    "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_b": {
                        "b": false
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "transpose_a": {
                        "b": false
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/Sigmoid",
                "op": "Sigmoid",
                "input": [
                    "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/BiasAdd"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/Sigmoid"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 561
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/MatMul/ReadVariableOp",
                    "shape": [
                        864,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_3/dense-128-tanh-1/BiasAdd/ReadVariableOp",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/MatMul/ReadVariableOp",
                    "shape": [
                        128,
                        25
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/sequential_3/dense-25-sigmoid/BiasAdd/ReadVariableOp",
                    "shape": [
                        25
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}